Revit 2026 API

# FailureDefinitionAccessor Properties

---

The FailureDefinitionAccessor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FailureDefinitionAccessor Class

Autodesk.Revit.DB Namespace